using System;

namespace Task4
{
    //////1. Написать программу, выводящую элементы двумерного массива по диагонали.
    //////2. Написать программу «Телефонный справочник»: создать двумерный массив 5х2, хранящий список телефонных контактов:первый элемент хранит имя контакта, второй — номер телефона/email.
    //////3. Написать программу, выводящую введённую пользователем строку в обратном порядке(olleH вместо Hello).
    //*«Морской бой»: вывести на экран массив 10х10, состоящий из символов X и O, где Х — элементы кораблей, а О — свободные клетки.
    class Program
    {
        static void Main(string[] args)
        {
            // var array = new int[10, 5]; // двухмерный массив из 10 строк и 5 столбцов.

            var array2D = new string[10, 10]
            {
                { "Х", "О", "О", "О", "Х", "Х", "О", "О", "О", "О" },
                { "Х", "О", "О", "О", "О", "О", "О", "Х", "Х", "О" },
                { "Х", "О", "Х", "Х", "О", "О", "О", "О", "О", "О" },
                { "Х", "О", "О", "О", "О", "О", "О", "О", "О", "О" },
                { "О", "О", "О", "О", "Х", "Х", "Х", "О", "О", "О" },
                { "О", "Х", "Х", "Х", "О", "О", "О", "О", "О", "О" },
                { "О", "О", "О", "О", "О", "О", "О", "О", "Х", "О" },
                { "О", "О", "О", "О", "О", "О", "Х", "О", "О", "О" },
                { "О", "Х", "О", "О", "Х", "О", "О", "О", "О", "О" },
                { "О", "О", "О", "О", "О", "О", "О", "О", "О", "О" }
            };

            
            int stringLenght = array2D.GetLength(0);
            // s = номер строки массива, k - номер колонки массива
            for (int s = 0; s < stringLenght; s++)
            {
                for (int k = 0; k < array2D.GetLength(0); k++)
                {
                    // переход на новую строку перед десятым элементом каждой строки
                    if (k == 9)
                    {
                        Console.WriteLine(array2D[s, k]);
                    }
                    else Console.Write(array2D[s, k]);
                }
            }

            Console.ReadLine();
        }
    }
}